; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	spectrograph4 - mode
	thermograph2 - mode
	thermograph1 - mode
	image3 - mode
	GroundStation6 - direction
	GroundStation0 - direction
	Star1 - direction
	Star5 - direction
	Star2 - direction
	Star4 - direction
	Star3 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 spectrograph4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star1)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument4 spectrograph4)
	(supports instrument4 image0)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument5 image0)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument6 image0)
	(supports instrument6 image3)
	(calibration_target instrument6 Star5)
	(supports instrument7 spectrograph4)
	(supports instrument7 image3)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 Star4)
	(supports instrument8 image3)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star3)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite3 Star4)
	(pointing satellite4 Planet11)
	(have_image Star7 image0)
	(have_image Planet8 image0)
	(have_image Star9 thermograph2)
	(have_image Phenomenon10 thermograph1)
	(have_image Planet11 spectrograph4)
))

)

; plan
1. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 8
2. (calibrate satellite3 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 8
3. (turn_to satellite3 planet8 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet8)
   goals met: 0 of 8
4. (take_image satellite3 planet8 instrument5 image0)
   added: (have_image planet8 image0)
   goals met: 1 of 8
5. (turn_to satellite3 phenomenon10 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 phenomenon10)
   goals met: 1 of 8
6. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 2 of 8
7. (take_image satellite3 phenomenon10 instrument5 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 3 of 8
8. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 3 of 8
9. (calibrate satellite4 instrument8 star3)
   added: (calibrated instrument8)
   goals met: 3 of 8
10. (turn_to satellite3 star7 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star7)
   goals met: 3 of 8
11. (take_image satellite3 star7 instrument5 image0)
   added: (have_image star7 image0)
   goals met: 4 of 8
12. (turn_to satellite3 star9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star9)
   goals met: 4 of 8
13. (take_image satellite3 star9 instrument5 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 5 of 8
14. (turn_to satellite3 star4 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 star4)
   goals met: 6 of 8
15. (turn_to satellite4 planet11 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 planet11)
   goals met: 7 of 8
16. (take_image satellite4 planet11 instrument8 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 8 of 8
